<html>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=utf-8" />
</HEAD>
<body>
	
<h2>TopoDroid MANUEL UTILISATEUR</h2>
<!-- NOW -->
<i>marco.corvi@gmail.com</i><br>
<p align="justify"> TopoDroid est une application Android pour la topographie 
  des cavit&eacute;s souterraines. TopoDroid r&eacute;cup&egrave;re les donn&eacute;es 
  brutes et vous aide &agrave; les organiser, et &agrave; produire un croquis 
  sur site. Vous pouvez ensuite dessiner un habillage autour du squelette de la 
  topographie tout en effectuant un relev&eacute; ce qui réduit ainsi la probabilit&eacute; 
  d'erreur entrant dans votre esquisse et vous aide &agrave; d&eacute;tecter les 
  erreurs dans les donn&eacute;es pendant que vous &ecirc;tes encore dans la caverne. 
  TopoDroid a de nombreuses fonctions pour vous aider &agrave; tirer le meilleur 
  parti de votre travail sous terre. De cette mani&egrave;re, la topographie est 
  presque termin&eacute;e &agrave; la fin de votre sortie topo. 
<p align="justify">TopoDroid rend plus efficace le temps que vous passez &agrave; 
  topographier sous terre. Il est con&ccedil;u pour g&eacute;rer un seul relev&eacute; 
  &agrave; la fois. Il ne g&egrave;re pas les projets de topographie des grottes 
  complexes qui comprennent un certain nombre de s&eacute;ances topo diff&eacute;rentes. 
  C'est parce que le but de TopoDroid est d'aider le topographe &agrave; collecter 
  les donn&eacute;es avec plus de pr&eacute;cision et de rendre la t&acirc;che 
  plus agr&eacute;able, et non de produire la topographie finale de la caverne. 
  Pour ce faire, de bons programmes PC existent d&eacute;j&agrave;.
<p>TopoDroid comporte cinq &quot;niveaux d'activité&quot; différents. Les niveaux 
  les plus bas disposent déjà de suffisamment de fonctionnalités pour télécharger 
  des données, gérer les noms des stations et dessiner des croquis simples. Les 
  niveaux supérieurs peuvent être utilisés pour préparer les données et les croquis 
  en vue d'un travail plus facile sur le PC.</p>
<p> TopoDroid est conçu pour traiter un seul relevé à la fois, et non pour gérer 
  des projets complexes d'étude de cavités comprenant plusieurs relevés différents. 
  Néanmoins, il comprend un gestionnaire de projet qui peut être utilisé pour 
  composer des relevés dans un projet de grotte/karst et un visualisateur 3D avec 
  lequel vous pouvez voir la 3D des relevés et des projets topographiques.</p>
<p> TopoDroid fonctionne avec les appareils suivants : DistoX (v. 1, 2 et BLE), 
  Sap5 et Bric4, mais les données des relevés peuvent être saisies manuellement.<br>
  Attention, les appareils Android (et le stylet actif) peuvent influencer les 
  mesures prises avec un appareil électronique, s'ils sont trop proches. <br>
</p>
<p> <b><a href="page_quick.htm">Guide rapide TopoDroid</a></b><br>
<p> <img src="map_sample.png" alt="ICON" /><br>
<p> <b>AVERTISSEMENT</b><br>
  TopoDroid est une application gratuite open-source sans publicit&eacute;. Il 
  est sans garantie : en l'utilisant, vous acceptez que les auteurs ne soient 
  pas responsables de toute perte ou dommage aux donn&eacute;es que vous pourriez 
  subir, en particulier sur le DistoX. Bien que les auteurs fassent de leur mieux 
  pour fournir une application sans bug, ceci n'est pas garanti. 
<hr><br>
<p><b>Caract&eacute;ristiques mat&eacute;rielles</b>
<p>TopoDroid utilise les fonctionnalit&eacute;s mat&eacute;rielles suivantes: 
  &quot;Bluetooth&quot;, &quot;Photographie&quot;, &quot;Micro&quot;, &quot;GPS&quot;, 
  &quot;Multitouch&quot;. Les fonctions de TopoDroid qui n&eacute;cessitent une 
  fonctionnalit&eacute; non pr&eacute;sente sur votre appareil Android sont automatiquement 
  d&eacute;sactiv&eacute;es.</p>
<p><br>
  <b>Erreurs et incidents</b></p>
<p align="justify">En raison de ressources limit&eacute;es, l'apk ne peut pas 
  &ecirc;tre test&eacute; enti&egrave;rement. Il est conseill&eacute; d'installer 
  les mises &agrave; jour TopoDroid avec un apk-manager qui conserve l'apk des 
  versions pr&eacute;c&eacute;demment install&eacute;es. Par ce moyen, vous pouvez 
  revenir en toute s&eacute;curit&eacute; &agrave; une version qui vous convient, 
  au cas o&ugrave; vous rencontreriez des probl&egrave;mes avec le dernier apk. 
  N'oubliez pas de signaler vos probl&egrave;mes afin qu'ils soient pris en compte 
  dans la prochaine version. Les rapports de bogues sont rapidement pris en compte 
  et l'application est fr&eacute;quemment mise &agrave; jour. </p>
<ul>
  <li>Si possible configurez votre syst&egrave;me Android pour signaler automatiquement 
    les incidents (voir les d&eacute;tails sur les pages Web).</li>
  <li>Si vous rencontrez une erreur ou si l'application ne se comporte pas comme 
    pr&eacute;vu, envoyez-moi un email. Inclure la version de l'application.</li>
  <li>Si vous avez une question g&eacute;n&eacute;rale ou une demande de fonctionnalit&eacute;, 
    envoyez un courriel &agrave; la liste de diffusion TopoDroid.</li>
</ul>
<br><p>
	
	<hr>
<b>Traductions </b>: V. Georgiev (bulgare), H.J. Luo (chinois), F. Martin - D. 
Ros (fran&ccedil;ais), M. Keller (allemand), P. Suru (hongrois), F. Toso (italien), 
A. Roncolato - R. Severo (portugais). A. Kozhenkov (russe), I. Raguz (slov&egrave;ne), 
M. Guerrero - J. Pardo (espagnol), V. Kozly (ukrainien), <br>
<p> Site Web : https://sites.google.com/site/speleoapps/<br>
  Sources : https://github.com/marcocorvi/topodroid<br>
<p> <b>Traductions du Manuel Utilisateur :</b><br>
  Russe : https://github.com/akozhenkov/TD_manual_RU<br>
  Espagnol : https://github.com/xguerrero/Topodroid_manual_es<br>
  Italien : https://github.com/fato63/TopoItMan/blob/master<br>
  Fran&ccedil;ais : http://souterweb.free.fr/topographie/topodroid_travaux/fr/manual00.htm<br>

<p> <a href="manual01.htm">Introduction &gt;</a> 
</body></html>